SET NAMES UTF8;
DROP DATABASE IF EXISTS bz;
CREATE DATABASE bz CHARSET=UTF8;
USE bz;
#用户表
CREATE TABLE bz_user()
  uid INT PRIMARY KEY AUTO_INCREMENT NOT NULL,
  uname VARCHAR(36),
  upwd VARCHAR(32),
  user_name VARCHAR(32),
  country VARCHAR(16),
  phone VARCHAR(16) NOT NULL UNIQUE,
  avatar VARCHAR(128)
;
INSERT INTO bz_user VALUES
(NULL,'lei','123456879','李然','中国','15234896520','image'),
(NULL,'feng','123780210','王明','中国','13364102589','image'),
(NULL,'lei','465565655','陈俊','中国','12658792010','image'),
(NULL,'wanger','10223598','项湘雅','中国','15349932107','image'),
(NULL,'rouse','525695045','李云龙','中国','13698220156','image'),
(NULL,'dangdang','165723a54','廖帆','中国','13524153359','image'),


#奔驰家族信息
CREATE TABLE bz_family (
  lid INT PRIMARY KEY AUTO_INCREMENT,
  fname VARCHAR
);
INSERT INTO bz_site_info VALUES
('NULL','coupe'),    #轿车
('NULL','SUV'),       
('NULL','roadster'), #轿跑
('Null','MPV')


#奔驰
CREATE TABLE bz(
  lid INT PRIMARY KEY AUTO_INCREMENT,
  family_id INT,             #所属型号家族编号 
  title VARCHAR(64),         #标题
  fuel_type VARCHAR(20)      #燃油类型
  rated_power VARCHAR(40)    #额定功率
  displacement VARCHAR(30)   #排量
  dioxide  VARCHAR(20)       #综合二氧化碳排放量
  fuel_oil VARCHAR(20)       #综合燃油消耗量
  gearbox VARCHAR(36)        #变速箱
  acceleration VARCHAR(30)   #百公里加速
  maximum_speed VARCHAR(30)  #最高车速
  price DECIMAL(9,0),        #价格
)
INSERT INTO bz_navbar_item VALUES
('NULL','1','S 320L','高级无铅汽油','220千瓦(299马力)4个气缸','1991 毫升','169克/公里','7.0升/100公里','9速自动变速箱(9G-TRONIC)','6.8秒','250 公里/小时','865000'),
('NULL','1','梅赛德斯-迈巴赫 S 450 4MATIC','高级无铅汽油','270千瓦(367马力)6个气缸','2996 毫升','221克公里','9.2升/100公里','9速自动变速箱(9G-TRONIC)','5.9秒','250 公里/小时','1400000'),
('NULL','1','E 200 L 4MATIC','高级无铅汽油','135千瓦(184马力)4个气缸','1991 毫升','182克公里','7.6升/100公里','9速自动变速箱(9G-TRONIC)','8.8秒','229 公里/小时','450000'),
('NULL','1','C 300 L 运动轿车','高级无铅汽油','190千瓦 (258马力)4个气缸','1991 毫升','160克/公里','6.7升/100公里','9速自动变速箱(9G-TRONIC)','6.4秒','250 公里/小时','486000'),
('NULL','1','C 200 旅行轿车','高级无铅汽油','135千瓦 (184马力)4个气缸','1991 毫升','157克/公里','6.5升/100公里','9速自动变速箱(9G-TRONIC)','7.7秒','230 公里/小时','388000'),
('NULL','1','CLA 200 动感型','高级无铅汽油','115千瓦 (156马力)4个气缸','1595 毫升','148克/公里','6.1升/100公里','7速双离合器变速箱(7G-DCT)','8.3秒','230公里/小时','256800'),
('NULL','1','A 180 L 轿车','高级无铅汽油','100千瓦 (136马力)4个气缸','1332 毫升','129克/公里','5.4升/100公里','7速双离合器变速箱(7G-DCT)','9.1秒','218公里/小时','218000'),
('NULL','1','B 200 动感型','高级无铅汽油','115千瓦 (156马力)4个气缸','1595 毫升','152克/公里','6.4升/100公里','7速双离合器变速箱(7G-DCT)','8.3秒','220公里/小时','243000'),
('NULL','2','G 500','高级无铅汽油','310千瓦 (421马力)8个气缸','3892 毫升','null','11.8升/100公里','9速自动变速箱(9G-TRONIC)','5.9秒','210公里/小时','1588000'),
('NULL','2','GLS 320 4MATIC','高级无铅汽油','200千瓦 (272马力)6个气缸','2996 毫升','242克/公里','10.0升/100公里','9 速自动变速箱 (9G-TRONIC)','8.6秒','225公里/小时','1028000'),
('NULL','2','GLE 320 4MATIC 豪华型 臻藏版','高级无铅汽油','200千瓦 (272马力)6个气缸','2996 毫升','221克/公里','9.3升/100公里','9 速自动变速箱 (9G-TRONIC)','7.6秒','230公里/小时','794000'),
('NULL','2','GLC 200 4MATIC 轿跑 SUV','高级无铅汽油','135千瓦 (184马力)4个气缸','1991 毫升','171克/公里','7.2升/100公里','9 速自动变速箱 (9G-TRONIC)','8.2秒','210公里/小时','464000'),
('NULL','2','GLA 200 动感型','高级无铅汽油','115千瓦 (156马力)4个气缸','1595 毫升','156克/公里','6.5升/100公里','7 速双离合器变速箱 (7G-DCT)','8.5秒','215公里/小时','270000'),
('NULL','2','梅赛德斯-AMG GLA 45 4MATIC','高级无铅汽油','280千瓦 (381马力)4个气缸','1991 毫升','191克/公里','8.0升/100公里','AMG SPEEDSHIFT DCT 7 速运动型双离合器变速箱','4.4秒','250公里/小时','538000'),
('NULL','3','梅赛德斯-奔驰CLS 350 4MATIC 四门轿跑车','高级无铅汽油','220千瓦 (299马力)4个气缸','1991 毫升','181克/公里','7.5升/100公里','9 速自动变速箱 (9G-TRONIC)','6.2秒','250公里/小时','808000'),
('NULL','3','E 200 轿跑车','高级无铅汽油','135千瓦 (184马力)4个气缸','1991 毫升','169克/公里','7.0升/100公里','9 速自动变速箱 (9G-TRONIC)','8.2秒','237公里/小时','528800'),
('NULL','3','SLC 260','高级无铅汽油','155千瓦 (211马力)4个气缸','1991 毫升','157克/公里','6.6升/100公里','9 速自动变速箱 (9G-TRONIC)','6.7秒','245公里/小时','518800'),
('NULL','3','C 200 轿跑车','高级无铅汽油','135千瓦 (184马力)4个气缸','1991 毫升','155克/公里','6.5升/100公里','9 速自动变速箱 (9G-TRONIC)','7.8秒','236公里/小时','358800'),
('NULL','3','梅赛德斯-AMG GT R','高级无铅汽油','430千瓦 (585马力)8个气缸','3982 毫升','276克/公里','11.6升/100公里','AMG SPEEDSHIFT DCT 7速运动型双离合器变速箱','3.6秒','318公里/小时','2155800'),
('NULL','3','S 450 4MATIC 轿跑车','270千瓦 (367马力)6个气缸','3982 毫升','222克/公里','9.2升/100公里','9 速自动变速箱 (9G-TRONIC)','5.6秒','250公里/小时','1243800'),
('NULL','3','SL 400','270千瓦 (367马力)6个气缸','2996 毫升','190克/公里','8.6升/100公里','9 速自动变速箱 (9G-TRONIC)','4.9秒','250公里/小时','1016800'),
('NULL','4','V 260 领航版','155千瓦 (211马力)4个气缸','1991 毫升','null','8.0升/100公里','7速自动变速箱增强版(7G-TRONIC PLUS)','null','185公里/小时','485000'),
('NULL','4','威霆高端商务车','155千瓦 (211马力)4个气缸','1991 毫升','null','8.6升/100公里','7速自动变速箱增强版(7G-TRONIC PLUS)','null','null','296000')

#轮播图
CREATE TBALE bz_carousel_item(
  cid INT PRIMARY KEY AUTO_INCREMENT,   #序号
  pic VARCHAR(128),
  url VARCHAR(128),
  title VARCHAR(32)
);
INSERT INTO bz_carousel_item VALUES(NULL,'images/xxx','','');

